{
    "SupportedClient": "version-e0126463331444db",
    "SoftwareVersion": "casual_likes_men",
    "Changelog": "It all started on a Tuesday — which, as everyone knows, is statistically the most boring day of the week. CasualDev sat on the edge of the skyscraper, legs dangling a hundred stories above the city, laptop glowing faintly beside him. He wasn’t sad, or scared, or even thinking about the drop. He was just… debugging.  The problem? His new AI-powered coffee app kept sending his espresso machine self-destruct commands.  After the fifth explosion, CasualDev had had enough. He climbed up to the roof to test the new wireless module — because, as every true developer knows, if it compiles, you must deploy from the highest possible point.  The wind howled. His hoodie flapped like a flag of chaos. Below, taxis honked in random syncopation — the city’s heartbeat.  CasualDev muttered, “If this update fails again, I’m jumping…” And then, with dramatic timing only the universe could orchestrate — it failed.  The screen flashed red. “BUILD ERROR: MISSING SEMICOLON.”  CasualDev sighed. “So be it.”  He picked up his laptop, backed up the code (he wasn’t that reckless), and took a running leap off the building — yelling something halfway between a war cry and a Stack Overflow rant.  As he fell, something amazing happened.  The Bluetooth module connected.  The coffee machine at home beeped triumphantly. A perfect espresso brewed. The smell of victory filled his apartment.  Meanwhile, CasualDev’s smartwatch deployed an emergency drone parachute — a prototype he’d forgotten he coded during a caffeine-fueled weekend. The parachute burst open midair, suspending him above the traffic like a confused superhero.  The crowd below gasped. Someone yelled, “Is that Elon Musk’s new intern?!”  CasualDev drifted down gently, landed in front of a coffee shop, and ordered a cappuccino. When the barista asked what he did for a living, he just smiled.  “Software engineer,” he said. “I test fall damage in real life.”"
}